# GetOptions Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElementGeometryCalculator..::..GetOptions Method
SpatialElementGeometryCalculator Class See Also
---
The options that control the calculation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public SpatialElementBoundaryOptions GetOptions()
```

Visual Basic
---
```text
Public Function GetOptions As SpatialElementBoundaryOptions
```

Visual C++
---
```text
public:
SpatialElementBoundaryOptions^ GetOptions()
```

# ### Return Value
The options.
# See Also
SpatialElementGeometryCalculator Class
Autodesk.Revit.DB Namespace